### Calculate MAE, MSE, CROSS-ENTROPY

In [1]:
import pandas as pd
import numpy as np

In [3]:
##model1 
dog_pre = [0.4, 0.3, 0.5, 0.6]
cat_pre = [0.3, 0.4, 0.2, 0.2]
other_pre = [0.3, 0.3, 0.3, 0.2]

dog_ans = [1, 0, 1, 0]
cat_ans = [0, 1, 0, 0]
other_ans = [0, 0, 0, 1]

In [5]:
model1 = pd.DataFrame({"Dog": dog_pre, "Cat":cat_pre, "Other":other_pre, "Dog_ans":dog_ans, "Cat_ans":cat_ans, "Other_ans":other_ans})
model1

   Dog  Cat  Other  Dog_ans  Cat_ans  Other_ans
0  0.4  0.3    0.3        1        0          0
1  0.3  0.4    0.3        0        1          0
2  0.5  0.2    0.3        1        0          0
3  0.6  0.2    0.2        0        0          1

In [7]:
##model2
dog_pre2 = [0.4, 0.3, 0.5, 0.6]
cat_pre2 = [0.3, 0.4, 0.2, 0.2]
other_pre2 = [0.3, 0.3, 0.3, 0.2]

dog_ans2 = [1, 0, 1, 0]
cat_ans2 = [0, 1, 0, 0]
other_ans2 = [0, 0, 0, 1]

In [8]:
model2 = pd.DataFrame({"Dog": dog_pre2, "Cat":cat_pre2, "Other":other_pre2, "Dog_ans":dog_ans2, "Cat_ans":cat_ans2, "Other_ans":other_ans2})
model2

   Dog  Cat  Other  Dog_ans  Cat_ans  Other_ans
0  0.4  0.3    0.3        1        0          0
1  0.3  0.4    0.3        0        1          0
2  0.5  0.2    0.3        1        0          0
3  0.6  0.2    0.2        0        0          1

In [32]:
def MAE(arr1, arr2):
    return np.absolute(arr1 - arr2).mean()
#     ##INPUT: TWO DATAFRAME
#     ##OUTPUT: ERROR VALUE

In [17]:
pred = model1.iloc[:, :3]
pred

   Dog  Cat  Other
0  0.4  0.3    0.3
1  0.3  0.4    0.3
2  0.5  0.2    0.3
3  0.6  0.2    0.2

In [18]:
ans = model1.iloc[:, 3:]
ans

   Dog_ans  Cat_ans  Other_ans
0        1        0          0
1        0        1          0
2        1        0          0
3        0        0          1

In [33]:
print(MAE(pred.values, ans.values))

0.4166666666666666

In [34]:
def MSE(arr1, arr2):
    return np.mean(np.absolute(arr1 - arr2)**2)

In [35]:
print(MSE(pred.values, ans.values))

0.20833333333333337

In [51]:
mask = ans[ans != 0]
print(ans)
ans = mask[mask==np.NAN]
ans

   Dog_ans  Cat_ans  Other_ans
0      1.0      NaN        NaN
1      NaN      1.0        NaN
2      1.0      NaN        NaN
3      NaN      NaN        1.0

   Dog_ans  Cat_ans  Other_ans
0      NaN      NaN        NaN
1      NaN      NaN        NaN
2      NaN      NaN        NaN
3      NaN      NaN        NaN

In [40]:
def CROSS_ENTROPY(arr1, arr2):
    return -np.sum(arr1*np.log(arr2[arr2 != 0]))

In [41]:
print(CROSS_ENTROPY(pred.values, ans.values))

inf

C:\Users\User\AppData\Local\Temp\ipykernel_8268\3548248915.py:2: RuntimeWarning: divide by zero encountered in log
  return -np.sum(arr1*np.log([arr2 != 0]))